osetroff/ledlamp/old/k_atmega328p.cpp
#ifndef k_atmega328p
#define k_atmega328p
/*
    atmega328p dip28

    |1 RST    C5 28|  SCL
RXD |2 D0     C4 27|  SDA
TXD |3 D1     C3 26|
INT0|4 D2     C2 25|
INT1|5 D3     C1 24|
    |6 D4     C0 23|
    |7 VCC   GND 22|
    |8 GND  aref 21|
    |9 B6   AVCC 20|
    |10 B7    B5 19|  SCK
T1  |11 D5    B4 18|  MISO
    |12 D6    B3 17|  MOSI
    |13 D7    B2 16|
    |14 B0    B1 15|

   atmega328 arduino mini


    DTR TXD RXD VCC GND GND
     o   o   o   o   o  o
TXD |  D1            RAW |
RXD |  D0            GND |
    |  RST           RST |
    |  GND           VCC |
INT0|2 PD2        PC3 A3 |
INT1|3 PD3        PC2 A2 |
T0  |4 PD4        PC1 A1 |
T1  |5 PD5        PC0 A0 |
    |6 PD6        PB5 13 |  SCK
    |7 PD7        PB4 12 | MISO
    |8 PB0        PB3 11 | MOSI
    |9 PB1        PB2 10 |
*/

#include <avr/sleep.h>
#include <avr/wdt.h>
#include <avr/power.h>
#include <avr/interrupt.h>
#include <avr/io.h>
//#include "Arduino.h"

#define k_cli() cli()
#define k_sei() sei()

static inline byte k_iswatchdogerror(){return (GPIOR0&(1<<WDRF));}

//========================
//
//========================
//4,294,967,295/(year=366*24*3600sec=31,622,400) > 135 years
//65,535/(day=24*3600sec=86400sec)

typedef unsigned char byte;
typedef unsigned short word;
typedef unsigned int dword;


//========================
//  memory
//========================
word testheap() {
  extern word __heap_start, *__brkval;
  return (word) __brkval;
}
word testsp(){
 byte lsp;
 return (word)&lsp;
}
//get free ram size
//word testram (){return RAMEND - word (__malloc_heap_start);}


//========================
//
//========================

//set freq of atmega
//0 clock_div_1
//1 clock_div_2
//2 clock_div_4
//3 clock_div_8
//4 clock_div_16
//5 clock_div_32
//6 clock_div_64
//7 clock_div_128
//8 clock_div_256
#define freq(lclk_div) cli();CLKPR = 1<<CLKPCE;CLKPR = lclk_div;sei()



//========================
// int
//========================
#define int0en() if ((EIMSK&(1<<INT0))==0) {EIFR|=(1<<INTF0);EIMSK|=(1<<INT0);}
#define int0dis() EIMSK &= ~(1<<INT0)
#define int0low() EICRA&=~((1<<ISC00)|(1<<ISC01))
#define int1en() if ((EIMSK&(1<<INT1))==0) {EIFR|=(1<<INTF1);EIMSK|=(1<<INT1);}
#define int1dis() EIMSK &= ~(1<<INT1)
#define int1low() EICRA&=~((1<<ISC10)|(1<<ISC11))



//========================
//   delay
//========================

//16000000/1000000 = 16 ticks for 1 us,
//2 ticks sbiw + 2 ticks brne = 4 ticks for one loop step
//so we need (16*ticks_us)/4  =  loop steps
inline void dus(word tic_us){
      register uint16_t tic_us0=(((F_CPU/1000000)*tic_us)>>2);
      __asm__ volatile (
        "l%=: sbiw %0,1    \n\t"
        "brne l%=     \n\t"
        : "=w" (tic_us0)
        : "0" (tic_us0)
      );
}
void dms(word tic_ms){while(tic_ms-->0){dus(1000);}}


//========================
//   adc and ac
//========================
#define adc_off() ADCSRA &= ~(1 << ADEN)
#define adc_on() ADCSRA |= (1 << ADEN)
#define ac_off() ACSR |= (1 << ACD)
#define ac_on() ACSR &= ~(1 << ACD)



//========================
//   eeprom
//========================
inline static byte eerb(word addr) {
  while (!bit_is_clear(EECR, EEPE));
  EEAR = addr;
  EECR |= 1 << EERE;  /* Start eeprom read by writing EERE */
  return EEDR;
}
//!!!! always test for eeprom errors!!!
//ret 1 if error , ret 0 if ok
inline static byte eewb(word addr, byte val) {
  byte lprev=eerb(addr);
  if (lprev!=val) {
    while (!bit_is_clear(EECR, EEPE));
    EEAR = addr;
    EEDR = val;
    EECR |= 1 << EEMPE; /* Write logical one to EEMPE */
    EECR |= 1 << EEPE;  /* Start eeprom write by setting EEPE */
    //test for errors
    if (eerb(addr)!=val) return 1;
  }
  return 0;
}

//========================
//  spi
//========================
#define spi_ddr	DDRB
#define spi_port	PORTB
//pin 11
#define spi_mosi_pin	(1<<3)
//pin12
#define spi_miso_pin	(1<<4)
//pin13
#define spi_sck_pin	(1<<5)
//
#define spi_clock_mask 0x03  // spr1 = bit 1, spr0 = bit 0 on spcr
#define spi_2xclock_mask 0x01  // spi2x = bit 0 on spsr
#define spi_clock_div4 0x00
#define spi_clock_div16 0x01
#define spi_clock_div64 0x02
#define spi_clock_div128 0x03
#define spi_clock_div2 0x04
#define spi_clock_div8 0x05
#define spi_clock_div32 0x06
//
#define spi_mode_mask 0x0c  // cpol = bit 3, cpha = bit 2 on spcr
#define spi_mode0 0x00
#define spi_mode1 0x04
#define spi_mode2 0x08
#define spi_mode3 0x0c
inline static void spi_setclockdiv(byte clockdiv) {
    SPCR = (SPCR & ~spi_clock_mask) | (clockdiv & spi_clock_mask);
    SPSR = (SPSR & ~spi_2xclock_mask) | ((clockdiv >> 2) & spi_2xclock_mask);
}
static void spi_init(byte ldatamode,byte lclockdiv) {
  //SCK & MOSI & SS as outputs, MISO as input
  spi_ddr &= ~spi_miso_pin;
  spi_ddr |= spi_sck_pin | spi_mosi_pin;
  //Enable SPI master, set mode
  SPCR = (1 << SPE) | (1 << MSTR)| (ldatamode & spi_mode_mask);
  //MSB
  //SPCR &= ~(1<<DORD);
  //clock div
  spi_setclockdiv(lclockdiv);
}
#define spi_wait 250
#define spi_waitasm() asm volatile("nop\n");

//!!!spi is bidirectional: every time we send byte too.
//it is important what byte we will send

//read byte
//write lw to spi,read byte to *lb
//ret 0 if ok
inline static byte spi_wbr(byte lw,byte *lb) {
  register byte li=0;
  SPDR=lw;
  while (li++<spi_wait) {
    if (SPSR & (1 << SPIF)) {
      *lb=SPDR;
      return 0;
    }
    spi_waitasm();
  }
  //li=SPDR;
  return 1;
}


//write byte lw to spi,read byte to *lb
//ret 0 if ok
inline static byte spi_wb(byte lw) {
  register byte li=0;
  SPDR=lw;
  while (li++<spi_wait) {
    if (SPSR & (1 << SPIF)) {
         //maibe we need lw=SPDR in the end to reset SPIF
         //li=SPDR;
       return 0;
    }
    spi_waitasm();
  }
  return 1;
}

//write ln bytes to spi
//ret 0 if ok
static byte spi_w(byte ln,byte * lb) {
  while (ln--) {
    SPDR=*lb++;
    register byte li=0;
    while(li++<spi_wait) {
      if (SPSR & (1 << SPIF)) {break;}
      spi_waitasm();
    }
    if (li==spi_wait) {return 1;}
  }
  return 0;
}

//read ln bytes from spi
//ret 0 if ok
static byte spi_r(byte ln,byte * lb,byte lw) {
  while (ln--) {
    SPDR=lw;
    register byte li=0;
    while(li++<spi_wait) {
      if (SPSR & (1 << SPIF)) {*lb++=SPDR;break;}
      spi_waitasm();
    }
    if (li==spi_wait) {return 1;}
  }
  return 0;
}


//==============
//i2c
//==============
/*
Return values.
Looking at a full communication sequence between a
master and slave (transmit data and then readback data) there
a total of 7 points in the sequence where a timeout can occur.
  0 - OK
  1 - Waiting for successful completion of a Start bit
  2 - Waiting for ACK/NACK while addressing slave in transmit mode (MT)
  3 - Waiting for ACK/NACK while sending data to the slave
  4 - Waiting for successful completion of a Repeated Start
  5 - Waiting for ACK/NACK while addressing slave in receiver mode (MR)
  6 - Waiting for ACK/NACK while receiving data from the slave
  7 - Waiting for successful completion of the Stop bit
  8 - 0xFF    See datasheet for exact meaning
*/


