osetroff/ledlamp/old/k_atmega328p.cpp
//=========================
#define START           0x08
#define REPEATED_START  0x10
#define MT_SLA_ACK  0x18
#define MT_SLA_NACK 0x20
#define MT_DATA_ACK     0x28
#define MT_DATA_NACK    0x30
#define MR_SLA_ACK  0x40
#define MR_SLA_NACK 0x48
#define MR_DATA_ACK     0x50
#define MR_DATA_NACK    0x58
#define LOST_ARBTRTN    0x38
#define TWI_STATUS      (TWSR & 0xF8)
#define SLA_W(address)  (address << 1)
#define SLA_R(address)  ((address << 1) + 0x01)
#define cbi(sfr, bit)   (_SFR_BYTE(sfr) &= ~_BV(bit))
#define sbi(sfr, bit)   (_SFR_BYTE(sfr) |= _BV(bit))

#define MAX_BUFFER_SIZE 32
//=========================
#define i2c_wait() dus(5)
//idle(_15);
#define i2c_waitcount 60
//======================
//releases SDA and SCL lines to high impedance
inline void i2c_disable(){TWCR = 0;}
//==========================
//initialize
inline void i2c_enable(){TWCR = _BV(TWEN) | _BV(TWEA);}
//==========================
inline void i2c_lockup() {
  i2c_disable();
  i2c_enable();
}
//==========================
#define i2c_wait_(ltwi,ltxt) \
  register byte li=i2c_waitcount; \
  while (!(TWCR & (1<<ltwi))) {\
    if (--li==0) {\
      i2c_lockup();\
      return(1);\
    } \
    i2c_wait();\
  } //sp(ltxt);spln(li);

//======================
static void i2c_speed(byte lspeedmul100000){
  cbi(TWSR, TWPS0);cbi(TWSR, TWPS1);
  TWBR = ((F_CPU / (lspeedmul100000*100000L)) - 16) / 2;
}
//======================
inline void i2c_init(byte lspeedmul100000=4){
  //setup ports
  sbi(PORTC, 4);
  sbi(PORTC, 5);
  // default
  i2c_speed(lspeedmul100000);
  i2c_enable();
}
//==========================
inline uint8_t i2c_start(){
  TWCR = (1<<TWINT)|(1<<TWSTA)|(1<<TWEN);
  i2c_wait_(TWINT,"start");
  li=TWI_STATUS;
  if (( li==START) || (li==REPEATED_START)) {return(0);}
  if (li==LOST_ARBTRTN)  {i2c_lockup();}
  return li;
}
//===========================
uint8_t i2c_stop(byte lwait){
  TWCR = (1<<TWINT)|(1<<TWEN)| (1<<TWSTO);
  if (lwait>0) {i2c_wait_(TWSTO,"stop"); }
  return(0);
}
//============================
inline uint8_t i2c_sa(uint8_t i2cAddress){
  TWDR = i2cAddress;
  TWCR = (1<<TWINT) | (1<<TWEN);
  i2c_wait_(TWINT,"sa");
  li=TWI_STATUS;
  if ((li==MT_SLA_ACK) || (li==MR_SLA_ACK)) {return(0);}
  if ((li==MT_SLA_NACK) || (li==MR_SLA_NACK))  {
    i2c_stop(1);
  }  else  {
    i2c_lockup();
  }
  return li;
}
//=============================
// Used to check for a response, while waiting for an EEPROM write.
uint8_t i2c_acknowledgepoll(uint8_t i2cAddress) {
  i2c_start();
  TWDR = SLA_W(i2cAddress);
  TWCR = (1<<TWINT) | (1<<TWEN);
  i2c_wait_(TWINT,"ack");
  li=TWI_STATUS;
  if ((li==MT_SLA_ACK) || (li==MR_SLA_ACK))  { return 1;}
  if ((li==MT_SLA_NACK) || (li==MR_SLA_NACK))  {
    return 0;
  }  else  {
    i2c_lockup();
  }
  return li;
}
//=======================
inline uint8_t i2c_sb(uint8_t i2cData){
  TWDR = i2cData;
  TWCR = (1<<TWINT) | (1<<TWEN);
  i2c_wait_(TWINT,"sb");
  li=TWI_STATUS;
  if (li==MT_DATA_ACK)  {return(0); }
  if (li==MT_DATA_NACK)  {
    i2c_stop(1);
  }  else  {
    i2c_lockup();
  }
  return li;
}
//======================
inline uint8_t i2c_rb(uint8_t ack){
  if(ack){TWCR = (1<<TWINT)|(1<<TWEN)|(1<<TWEA);}
  else {TWCR = (1<<TWINT) | (1<<TWEN);}
  i2c_wait_(TWINT,"rb");
  li=TWI_STATUS;
  if (li==LOST_ARBTRTN)  { i2c_lockup();}
  return li;
}
/*
//======================
void i2c_pullup(uint8_t activate)
{
  if(activate)  {
    #if defined(__AVR_ATmega168__) || defined(__AVR_ATmega8__) || defined(__AVR_ATmega328P__)
      // activate internal pull-ups for twi as per note from atmega8 manual pg167
      sbi(PORTC, 4);sbi(PORTC, 5);
    #else
      // activate internal pull-ups for twi as per note from atmega128 manual pg204
      sbi(PORTD, 0);sbi(PORTD, 1);
    #endif
  }  else  {
    #if defined(__AVR_ATmega168__) || defined(__AVR_ATmega8__) || defined(__AVR_ATmega328P__)
      // deactivate internal pull-ups for twi as per note from atmega8 manual pg167
      cbi(PORTC, 4);cbi(PORTC, 5);
    #else
      // deactivate internal pull-ups for twi as per note from atmega128 manual pg204
      cbi(PORTD, 0);cbi(PORTD, 1);
    #endif
  }
}
*/
//=========================
//read
uint8_t i2c_r(uint8_t address,
              uint16_t ln,
              uint8_t *data){
  if(ln == 0){ln++;}

  register byte lr=i2c_start();
  if (lr) {lr=i2c_start();if (lr) return(lr);}

  lr = i2c_sa(SLA_R(address));
  if (lr) {if(lr == 1){return(5);}return(lr);}

  uint8_t * lp=data;
  while (ln-->0)  {
    if( ln == 0 ) {
      lr = i2c_rb(0);
      if(lr == 1){return(6);}
      if(lr != MR_DATA_NACK){return(lr);}
    }  else  {
      lr = i2c_rb(1);
      if(lr == 1){return(6);}
      if(lr != MR_DATA_ACK){return(lr);}
    }
    *lp++ = TWDR;
  }
  lr=i2c_stop(0);
  if (lr==1) lr=7;
  return lr;
}
//=============================
//read
uint8_t i2c_r(uint8_t address,
              uint16_t regaddress,
              uint16_t ln,
              uint8_t *data,
              byte ra16){
  if(ln == 0){ln++;}

  register byte lr=i2c_start();
  if (lr) {lr=i2c_start();if (lr) return(lr);}

  lr = i2c_sa(SLA_W(address));
  if (lr) {if(lr == 1){return(2);}return(lr);}
  if (ra16){
      lr = i2c_sb(regaddress >> 8);
      if (lr) {if(lr == 1){return(3);}return(lr);}
  }
  lr = i2c_sb(regaddress & 0xff);
  if (lr) {if(lr == 1){return(3);}return(lr);}

  lr = i2c_start();
  if (lr) {if(lr == 1){return(4);}return(lr);}

  lr = i2c_sa(SLA_R(address));
  if (lr) {if(lr == 1){return(5);}return(lr);}
  uint8_t * lp=data;
  while (ln-->0)  {
    if( ln == 0 ) {
      lr = i2c_rb(0);
      if(lr == 1){return(6);}
      if(lr != MR_DATA_NACK){return(lr);}
    }  else  {
      lr = i2c_rb(1);
      if(lr == 1){return(6);}
      if(lr != MR_DATA_ACK){return(lr);}
    }
    *lp++ = TWDR;
  }
  lr=i2c_stop(0);
  if (lr==1) lr=7;
  return lr;
}
//=========================
//write
uint8_t i2c_w(uint8_t address,
              uint16_t regaddress,
              uint16_t ln,
              uint8_t *data,
              byte ra16){

  register byte lr=i2c_start();
  if (lr) {lr=i2c_start();if (lr) return(lr);}

