osetroff/ledlamp/old/k_atmega328p.cpp
  lr = i2c_sa(SLA_W(address));
  if (lr) { if(lr == 1){return(2);}return(lr);}
  if (ra16){
    lr = i2c_sb(regaddress >> 8);
    if (lr) {if(lr == 1){return(3);}return(lr);}
  }
  lr = i2c_sb(regaddress & 0xff);
  if (lr) {if(lr == 1){return(4);}return(lr);}
  uint8_t * lp=data;
  while (ln-->0) {
    lr = i2c_sb(*lp++);
    if (lr) {if(lr == 1){return(5);}return(lr);}
  }
  lr=i2c_stop(0);
  if (lr==1) lr=7;
  return lr;
}


//========================
//  power
//========================
//==========ISR (WDT_vect) Watchdog Timer interrupt service routine.
//This routine is required to allow automatic WDIF and WDIE bit clearance in hardware.
// WDIE & WDIF is cleared in hardware upon entering this ISR
//ISR (WDT_vect){wdt_disable();}
//asm volatile("nop");
enum period_t {_15,_30,_60,_120,_250,_500,_1s,_2s,_4s,_8s,_forever};
enum adc_t{adc0,adc1};
enum bod_t{b0,b1};
enum timer2_t{t20,t21};
enum timer1_t{t10,t11};
enum timer0_t{t00,t01};
enum spi_t{s0,s1};
enum usart0_t{u0,u1};
enum twi_t{t0,t1};
//IDLE 15 mA
//ADC 6.5 mA
//PWR_SAVE 1.62 mA !!! clock on timer 2 will be slower (1ms for 1s)
//EXT_STANDBY 1.62 mA !!!clock on timer 2 will ok
//STANDBY  0.84 mA
//PWR_DOWN  0.36 mA

//reset
void reset(period_t lp) {
    wdt_disable();
    wdt_enable(lp);
    while (1) {}
}

#ifndef sleep_bod_disable
inline void sleep_bod_disable() {
  //do {
  unsigned char tempreg;
  __asm__ __volatile__("in %[tempreg], %[mcucr]" "\n\t" \
                       "ori %[tempreg], %[bods_bodse]" "\n\t" \
                       "out %[mcucr], %[tempreg]" "\n\t" \
                       "andi %[tempreg], %[not_bodse]" "\n\t" \
                       "out %[mcucr], %[tempreg]" \
                       : [tempreg] "=&d" (tempreg) \
                       : [mcucr] "I" _SFR_IO_ADDR(MCUCR), \
                         [bods_bodse] "i" (_BV(BODS) | _BV(BODSE)), \
                         [not_bodse] "i" (~_BV(BODSE))); \
  //} while (0);
}
#endif




inline void	lowPowerBodOn(byte mode) {
  //do {
    set_sleep_mode(mode);
    cli();
    sleep_enable();
    sei();
    sleep_cpu();
    sleep_disable();
    sei();
  //} while (0);
}




inline void lowPowerBodOff(byte mode) {
  //do {
    set_sleep_mode(mode);
    cli();
    sleep_enable();
    sleep_bod_disable();
    sei();
    sleep_cpu();
    sleep_disable();
    sei();
  //} while (0);
}




inline void wdtsleep(period_t period) {
  if (period != _forever){
    wdt_enable(period);
    WDTCSR |= (1 << WDIE);
  //!!!!
  } else {wdt_disable();}
}


/*
#define t2begin(timer2,a) \
  unsigned char clockSource = 0;\
  if (timer2 == t20){\
    if (TCCR2B & CS22) clockSource |= (1 << CS22);\
    if (TCCR2B & CS21) clockSource |= (1 << CS21);\
    if (TCCR2B & CS20) clockSource |= (1 << CS20);\
    TCCR2B &= ~(1 << CS22);TCCR2B &= ~(1 << CS21);TCCR2B &= ~(1 << CS20);\
    a;\
  }
#define t2end(timer2,a) \
  if (timer2 == t20){\
    if (clockSource & CS22) TCCR2B |= (1 << CS22);\
    if (clockSource & CS21) TCCR2B |= (1 << CS21);\
    if (clockSource & CS20) TCCR2B |= (1 << CS20);\
    a;\
  }
*/

//==================idle
void idle(period_t period){
  byte adc_ = (ADCSRA & (1 << ADEN));
  adc_off();power_adc_disable();
  power_spi_disable();
  power_usart0_disable();
  wdtsleep(period);
  lowPowerBodOn(SLEEP_MODE_IDLE);
  if (adc_>0) {power_adc_enable();adc_on();}
  power_spi_enable();
  power_usart0_enable();
}


/*
//==================idle
//!!!make errors in elf file
void idle(period_t period,adc_t adc,
                          timer2_t timer2,timer1_t timer1, timer0_t timer0,
                          spi_t spi, usart0_t usart0,twi_t twi){


  byte lt2=TCCR2B;
  if (timer2 == t20)  {
    TCCR2B&=~((1 << CS22)|(1 << CS21)|(1 << CS20));
    power_timer2_disable();
  }
  //t2begin(timer2,power_timer2_disable());
  if (adc == a0){adcoff();power_adc_disable();}

  if (timer1 == t10)	power_timer1_disable();
  if (timer0 == t00)	power_timer0_disable();
  if (spi == s0)		power_spi_disable();
  if (usart0 == u0)	power_usart0_disable();
  if (twi == t0)		power_twi_disable();

  wdtsleep(period);
  lowPowerBodOn(SLEEP_MODE_IDLE);
  if (adc == a0){power_adc_enable();adcon();}

  //t2end(timer2,power_timer2_enable());
  if (timer2 == t20)  {
    TCCR2B=lt2;
    power_timer2_enable();
  }
  if (timer1 == t10)	power_timer1_enable();
  if (timer0 == t00)	power_timer0_enable();
  if (spi == s0)		power_spi_enable();
  if (usart0 == u0)	power_usart0_enable();
  if (twi == t0)		power_twi_enable();

}
*/

//===============adcnoisereduction
inline void adcnr(period_t period,timer2_t timer2) {
  byte lt2=TCCR2B;
  //t2begin(timer2,);
  if (timer2 == t20)  {
    TCCR2B&=~((1 << CS22)|(1 << CS21)|(1 << CS20));
    power_timer2_disable();
  }
  wdtsleep(period);
  lowPowerBodOn(SLEEP_MODE_ADC);
  //t2end(timer2,);
  if (timer2 == t20)  {
    TCCR2B=lt2;
    power_timer2_enable();
  }
}


//================pwrsave
inline void pwrsave(period_t period,bod_t bod,timer2_t timer2) {
  byte lt2=TCCR2B;
  //t2begin(timer2,);
  if (timer2 == t20)  {
    TCCR2B&=~((1 << CS22)|(1 << CS21)|(1 << CS20));
    power_timer2_disable();
  }
  wdtsleep(period);
  if (bod == b0) {
    lowPowerBodOff(SLEEP_MODE_PWR_SAVE);
  } else  {
    lowPowerBodOn(SLEEP_MODE_PWR_SAVE);
  }
  //t2end(timer2,);
  if (timer2 == t20)  {
    TCCR2B=lt2;
    power_timer2_enable();
  }
}


//================extstandby
inline void extstandby(period_t period,bod_t bod,timer2_t timer2) {
  byte lt2;
  //t2begin(timer2,);
  if (timer2 == t20)  {
    lt2==TCCR2B;
    TCCR2B&=~((1 << CS22)|(1 << CS21)|(1 << CS20));
    power_timer2_disable();
  }
  wdtsleep(period);
  if (bod == b0) {
    lowPowerBodOff(SLEEP_MODE_EXT_STANDBY);
  } else  {
    lowPowerBodOn(SLEEP_MODE_EXT_STANDBY);
  }
  //t2end(timer2,);
  if (timer2 == t20)  {
    power_timer2_enable();
    TCCR2B=lt2;
  }
}


