osetroff/ledlamp/old/k_atmega328p.cpp
//==============standby
inline void standby(period_t period, bod_t bod) {
  wdtsleep(period);
  if (bod == b0) {
    lowPowerBodOff(SLEEP_MODE_STANDBY);
  } else  {
    lowPowerBodOn(SLEEP_MODE_STANDBY);
  }
}


//===============pwrdown
//to wait all chars be sended through uart
//before pwrdown, use:
//while (UCSR0B & (1<<UDRIE0)) {;} dus(120);
inline void	pwrdown(period_t period,bod_t bod) {
  wdtsleep(period);
  if (bod == b0) {
    lowPowerBodOff(SLEEP_MODE_PWR_DOWN);
  } else {
    lowPowerBodOn(SLEEP_MODE_PWR_DOWN);
  }
}




#define delay(a) dms(a)
//18
#define dms15 extstandby(_15,b0,t21);
//37
#define dms30 extstandby(_30,b0,t21);
//73
#define dms60 extstandby(_60,b0,t21);
//146
#define dms120 extstandby(_120,b0,t21);
//292
#define dms250 extstandby(_250,b0,t21);
//583
#define dms500 extstandby(_500,b0,t21);
//1.16
#define dms1s extstandby(_1s,b0,t21);
//2.33
#define dms2s extstandby(_2s,b0,t21);
//4.66
#define dms4s extstandby(_4s,b0,t21);
//9.32
#define dms8s extstandby(_8s,b0,t21);



//========================
//   port procs
//========================
//
#define _0 (1<<0)
#define _1 (1<<1)
#define _2 (1<<2)
#define _3 (1<<3)
#define _4 (1<<4)
#define _5 (1<<5)
#define _6 (1<<6)
#define _7 (1<<7)

//output
#define pbo(m) DDRB |=(m)
#define pco(m) DDRC |=(m)
#define pdo(m) DDRD |=(m)
//input
#define pbi(m) DDRB &=~(m)
#define pci(m) DDRC &=~(m)
#define pdi(m) DDRD &=~(m)
//high
#define pbh(m) PORTB |=(m)
#define pch(m) PORTC |=(m)
#define pdh(m) PORTD |=(m)
//input
#define pbl(m) PORTB &=~(m)
#define pcl(m) PORTC &=~(m)
#define pdl(m) PORTD &=~(m)
//xor
#define pbx(m) PORTB ^=(m)
#define pcx(m) PORTC ^=(m)
#define pdx(m) PORTD ^=(m)
//read
#define pbr(m) PIND&(m)
#define pcr(m) PINC&(m)
#define pdr(m) PIND&(m)
//==AnalogRead
word aread(byte An_pin){
  ADMUX=An_pin;
  dus(10);
  ADCSRA=0xc6; //B11000111-125kHz B11000110-250kHz
  while (ADCSRA & (1 << ADSC));
  An_pin = ADCL;
  return (ADCH<<8) + An_pin;
}
//==Analog READ
#define a1r (aread(B01000001))
#define a1r1 (aread(B11000001))
//
word readvcc() {
  register byte ladmux=ADMUX;
  register byte adc_ = (ADCSRA & (1 << ADEN));
  if (adc_ == 0) {power_adc_enable();adc_on();}
  // Read 1.1V reference against AVcc
  // set the reference to Vcc and the measurement to the internal 1.1V reference
  #if defined(__AVR_ATmega32U4__) || defined(__AVR_ATmega1280__) || defined(__AVR_ATmega2560__)
    ADMUX = _BV(REFS0) | _BV(MUX4) | _BV(MUX3) | _BV(MUX2) | _BV(MUX1);
  #elif defined (__AVR_ATtiny24__) || defined(__AVR_ATtiny44__) || defined(__AVR_ATtiny84__)
    ADMUX = _BV(MUX5) | _BV(MUX0);
  #elif defined (__AVR_ATtiny25__) || defined(__AVR_ATtiny45__) || defined(__AVR_ATtiny85__)
    ADMUX = _BV(MUX3) | _BV(MUX2);
  #else
    ADMUX = _BV(REFS0) | _BV(MUX3) | _BV(MUX2) | _BV(MUX1);
  #endif

  dms(20); // Wait 55ms for Vref to settle delay(75);
  ADCSRA |= _BV(ADSC); // Start conversion
  while (bit_is_set(ADCSRA,ADSC)); // measuring

  byte low  = ADCL; // must read ADCL first - it then locks ADCH
  byte high = ADCH; // unlocks both

  // Calculate Vcc (in mV); 1125300 = 1.1*1023*1000
  // Calculate Vcc 0.01V; 112530 = 1.1*1023*100
  ADMUX=ladmux;
  if (adc_ == 0) {adc_off();power_adc_disable();}
  return  112530L / ((high<<8) | low);
}
//==Small UART
//get voltage aref=vcc
word readv(byte lmask,word r1k,word r2k){
  if (lmask==0) return 0;
  byte adc_ = (ADCSRA & (1 << ADEN));
  if (adc_ == 0) {power_adc_enable();adc_on();}
  byte li=0;
  lmask>>=1;
  while (lmask>0) {li++;lmask>>=1;}
  li+=_6;
  word la=aread(li);
  //we need this dms!!!
  dms(20);
  la=aread(li);
  word lmin=aread(li);
  byte ln=4;
  while (ln-->0) {la=aread(li);if (la<lmin) {lmin=la;}}
  la=((dword)lmin*readvcc()/1023);
  if (adc_ == 0) {adc_off();power_adc_disable();}
  //dword
  return ((dword)la*(r1k+r2k))/r2k;
}


//=========
// uart
//=========
#define UART_DOUBLESPEED
#define UART_TXREADY UDRE0
#define UART_RXREADY RXC0
#define UART_DOUBLE	U2X0
#define UDR  UDR0
#define UCRA UCSR0A
#define UCRB UCSR0B
#define UCRC UCSR0C
#define UCRC_VALUE ((1<<UCSZ01) | (1<<UCSZ00))
#define RXCIE RXCIE0
#define TXCIE TXCIE0
#define RXEN RXEN0
#define TXEN TXEN0
#define UBRRL UBRR0L
#define UBRRH UBRR0H
#define SIG_UART_TRANS SIG_USART_TRANS
#define SIG_UART_RECV  SIG_USART_RECV
#define SIG_UART_DATA  SIG_USART_DATA
#define UART_CALC_BAUDRATE(baudRate) ((dword)((F_CPU) + ((dword)baudRate * 4UL)) / ((dword)(baudRate) * 8UL) - 1)
void UART_Init(dword UART_BAUD_RATE){
  UBRRH = (UART_CALC_BAUDRATE(UART_BAUD_RATE)>>8) & 0xFF;
  UBRRL = (UART_CALC_BAUDRATE(UART_BAUD_RATE) & 0xFF);
  UCSR0A = ( 1<<UART_DOUBLE );
  UCRB = ((1<<TXEN) | (1<<RXEN));
  UCRC = UCRC_VALUE;
}
void UART_SendByte(byte data){
  while (!(UCRA & (1<<UART_TXREADY)));
  UDR = data;
}
bool UART_ReadByte(byte& data){
  if (UCRA & (1<<UART_RXREADY)){
    data = UDR;
    return true;
  } else return false;
}
void UART_SendArray(byte *buffer, word bufferSize){
for(word i=0; i<bufferSize; i++) UART_SendByte(buffer[i]);
}








//=======================
// pseudorandom
//=======================
inline byte atmega328p_randbr() {
  ADCSRA |= _BV(ADSC); // Start conversion
  //while (bit_is_set(ADCSRA,ADSC)); // measuring
  byte low  = ADCL&1; // must read ADCL first - it then locks ADCH
  byte high = ADCH; // unlocks both
  //sph(high);sps;sph(low);spn;
  return  low;
}
//
inline byte atmega328p_randbr2() {
  register byte a;
  register byte li=10;//30
  do {
    a=atmega328p_randbr() | (atmega328p_randbr()<<1);
    // 1 to 0 transition: log a zero bit
    if (a==1) {return 0;}
    // 0 to 1 transition: log a one bit
    if (a==2) {return 1;}
    // For other cases, try again.
  } while (--li>0);
  return a&1;
}
//
inline byte atmega328p_randbit() {
  register byte a;
  register byte li=11;//20
  do {
    a=atmega328p_randbr2()|(atmega328p_randbr2()<<1);
    // 1 to 0 transition: log a zero bit
    if (a==1) {return 0;}
    // 0 to 1 transition: log a one bit
    if (a==2) {return 1;}
    // For other cases, try again.
  } while (--li>0);
  return a&2;
}
//laportc = 0-7
byte atmega328p_random(byte laportc){
  register byte ladmux=ADMUX;
  register byte adc_ = (ADCSRA & (1 << ADEN));
  if (adc_ == 0) {power_adc_enable();adc_on();}

  // Read 1.1V reference against Temp
  //ADMUX = _BV(REFS0) | _BV(REFS1) | _BV(MUX3) ;
  //read 1.1V against VCC
  //ADMUX = _BV(REFS0) | _BV(MUX3) | _BV(MUX2) | _BV(MUX1);
  //ADMUX =_BV(REFS0) |  _BV(MUX3) | _BV(MUX2) | _BV(MUX1)| _BV(MUX0);
  //sph(ADMUX);spn;
  //A0
  ADMUX=_BV(REFS0) | (laportc&0x7);
  //sph(ADCSRA);spn;
  //dms(5);
  register byte lr=0;
  for (byte i=8; i--;i>0) lr+=lr+atmega328p_randbit();

  ADMUX=ladmux;
  if (adc_ == 0) {adc_off();power_adc_disable();}

  return lr;
}
//
inline byte atmega328p_randb() {
  register byte a;
  register byte li=11;//20
  do {
    //vcc
    ADMUX = _BV(REFS0) | _BV(MUX3) | _BV(MUX2) | _BV(MUX1);
    a=atmega328p_randbr2();
    //temp
    ADMUX = _BV(REFS0)|_BV(REFS1)|_BV(MUX3);
    a|=(atmega328p_randbr2()<<1);
    // 1 to 0 transition: log a zero bit
    if (a==1) {return 0;}
    // 0 to 1 transition: log a one bit
    if (a==2) {return 1;}
    // For other cases, try again.
  } while (--li>0);
  return a&2;
}
//rand
byte atmega328p_rand(){
  register byte ladmux=ADMUX;
  register byte adc_ = (ADCSRA & (1 << ADEN));
  if (adc_ == 0) {power_adc_enable();adc_on();}
  register byte lr=0;
  for (byte i=9; i--;) lr+=lr+atmega328p_randb();
  ADMUX=ladmux;
  if (adc_ == 0) {adc_off();power_adc_disable();}
  return lr;
}



//===========================
#define atmega328p_init()  \
  MCUSR=0;wdt_enable(_8s); \
  adc_off();power_adc_disable();ac_off();\
  power_timer0_disable();\
  power_timer1_disable();\
  power_timer2_disable();\
  sleep_bod_disable();sei();

//MCUSR &= ~(1<<WDRF);
//power_all_disable();
//SPI.setClockDivider(SPI_CLOCK_DIV2)

//to find in disassembled text by avr-objdump -S ...elf > ...txt
#define _debugm asm volatile("cli");asm volatile("sei");


//---------------
// UART
//cyclic buffer for uart
#define serial_buf_max 20
byte serial_buf[serial_buf_max];
//index
volatile byte serial_buf_i;
//==1 if we have got '/n'
volatile byte serial_has_input;
//save uart incoming bytes to cyclic buffer
ISR(USART_RX_vect){
  register byte lb=UDR0;
  if ((lb=='\n')||(lb=='\r')) {serial_has_input=1;}
  else if (serial_buf_i<serial_buf_max) {serial_buf[serial_buf_i++]=lb;}
}
//clear buf
static void serial_buf_clear(){
  cli();serial_buf_i=0;serial_has_input=0;sei();
}

#define USART_BAUDRATE 38400
#define BAUD_PRESCALE (((F_CPU / (USART_BAUDRATE * 16UL))) - 1)
static void serial_init(){
  serial_buf_clear();
  // Turn on the transmission and reception circuitry
  UCSR0B = (1 << RXEN0) | (1 << TXEN0);
  // Use 8-bit character sizes
  UCSR0C = (1 << UCSZ01) | (1 << UCSZ00);
  // Load lower 8-bits of the baud rate value into the low byte of the UBRR register
  UBRRL = BAUD_PRESCALE;
  // Load upper 8-bits of the baud rate value into the high byte of the UBRR register
  UBRRH = (BAUD_PRESCALE >> 8);
  // Enable the USART Recieve Complete interrupt (USART_RXC)
  UCSR0B |= (1 << RXCIE);
}
static void serial_write(byte lb){
  while (!(UCRA & (1<<UART_TXREADY)));
  UDR0 = lb;
}

//---------------------
#ifdef _loguart
        #define _waituart 120

        //wait till uart will send all deb info
        inline void waituart(byte lus){
          if (UCSR0B & (1<<UDRIE0)) {
            word lms=2000;
            while (lms-->0) {
              if ((UCSR0B & (1<<UDRIE0))==0) {dus(lus);break;}
              dus(5);
            }
          }
        }

        //#include <HardwareSerial.h>

        void logb(){serial_init();sb();}
        void logo(){
            if (logi>0) {
                 for(byte li=0;li<logi;li++) {
                    serial_write(loga[li]);
                 }
            }
            serial_write('\r');
            serial_write('\n');
        }
        void loge(){;}

#endif
//-------------------------
//copy from flash to ram
static void cpf(byte * lfp,word ln,byte * lr){
  while (ln-->0) {
    *lr++=pgm_read_byte(lfp++);
  }
}
//--------------
template <typename T> void cp_fromflash(const T * sce, T& dest){
  memcpy_P (&dest, sce, sizeof (T));
}
//--------------
template <typename T> T get_fromflash(const T * sce){
  static T temp;
  memcpy_P (&temp, sce, sizeof (T));
  return temp;
}

#endif
